var MappingData = (function() {

  var self = {};

  self.gender = {
    neuter: {
      "男女雙方": "雙方",
      "男女": "雙方",
      "夫妻": "配偶",
      "爸爸媽媽": "雙親",
      "媽媽爸爸": "雙親",
      "父母": "雙親",
      "媽媽": "雙親",
      "爸爸": "雙親",
      "母親": "雙親",
      "父親": "雙親",
      "夫妻財產": "婚姻財產",
      "養父母": "養親",
      "子婦": "子女之配偶",
      "女婿": "子女之配偶",
      "祖父母": "二等親直系血親尊親屬",
      "養父母": "養親",
      "妻子": "另一半",
      "妻": "另一半",
      "男子漢大丈夫": "人",
      "大丈夫": "人",
      "丈夫": "另一半",
      "夫": "另一半",
      "太太": "另一半",
      "老婆": "另一半",
      "老公": "另一半",
      "女人": "人",
      "男人": "人",
      "女性": "人",
      "男性": "人",
      "女孩": "孩童",
      "男孩": "孩童",
      "她": "他"
    },
    // antonym: {
    //   "媽媽": "爸爸",
    //   "爸爸": "媽媽"
    // }
  };

  // self.racist = {};

  return self;

})();
