var MappingData = (function() {

  var self = {};

  self["性別"] = {
    "中性詞": {
      "男女雙方": "雙方",
      "男女": "雙方",
      "夫妻": "配偶",
      "爸爸媽媽": "雙親",
      "媽媽爸爸": "雙親",
      "父母": "雙親",
      "媽媽": "雙親",
      "爸爸": "雙親",
      "母親": "雙親",
      "父親": "雙親",
      "夫妻財產": "婚姻財產",
      "養父母": "養親",
      "子婦": "子女之配偶",
      "女婿": "子女之配偶",
      "祖父母": "二等親直系血親尊親屬",
      "養父母": "養親",
      "妻子": "另一半",
      "妻": "另一半",
      "男子漢大丈夫": "人",
      "大丈夫": "人",
      "丈夫": "另一半",
      "夫": "另一半",
      "太太": "另一半",
      "老婆": "另一半",
      "老公": "另一半",
      "女人": "人",
      "男人": "人",
      "女士": "人",
      "男士": "人",
      "女性": "人",
      "男性": "人",
      "女孩": "孩童",
      "男孩": "孩童",
      "她": "他",
      "妳": "你"
    },
    "反義詞": {
      "男女": "女男",
      "夫妻": "妻夫",
      "爸爸媽媽": "媽媽爸爸",
      "媽媽爸爸": "爸爸媽媽",
      "媽媽": "爸爸",
      "爸爸": "媽媽",
      "父母": "母父",
      "母親": "父親",
      "父親": "母親",
      "夫妻財產": "妻夫財產",
      "養父母": "養母父",
      "子婦": "女婿",
      "女婿": "子婦",
      "祖父母": "祖母父",
      "養父母": "養母父",
      "妻子": "丈夫",
      "妻": "夫",
      // "男子漢大丈夫": "女子xxxx",
      // "大丈夫": "人",
      "丈夫": "妻子",
      "夫": "妻",
      // "太太": "另一半",
      "老婆": "老公",
      "老公": "老婆",
      "女人": "男人",
      "男人": "女人",
      "女士": "男士",
      "男士": "女士",
      "女性": "男性",
      "男性": "女性",
      "女孩": "男孩",
      "男孩": "女孩",
      "她": "他",
      "妳": "你",
      "他": "她",
      "你": "妳"
    }
  };

  self["同性婚姻"] = {
    "萌＞童": {
      "同性戀": "異性戀",
      "異性戀": "同性戀",
      "同性": "異性",
      "異性": "同性",
    },
    // "童＞萌": {
    //   "同性戀": "異性戀",
    //   "異性戀": "同性戀"
    // }
  }

  // self.racist = {};

  return self;

})();
